Repository: johnpetersa19/game-of-life
Catalog: po/*.po
Languages: pt_br

source: Game of Life
pt_br: Jogo da vida

source: Game of Life Simulator
pt_br: Simulador da Jogo da vida

source: simulation;game;
pt_br: simulação; jogo;

source: Play Conway's Game of Life
pt_br: Jogue o jogo de vida de Conway

source: Game of Life lets you simulate simple universes made of cells that can be alive or dead, and evolve according to simple rules.
pt_br: O jogo da vida permite simular universos simples feitos de células que podem estar vivas ou mortas e evoluir de acordo com as regras simples.

source: Current features:
pt_br: Recursos atuais:

source: Random seed universes
pt_br: Universos de sementes aleatórias

source: Provide start templates
pt_br: Forneça modelos de início

source: Manually edit universes
pt_br: Editar manualmente universos

source: Save and restore snapshots
pt_br: Salvar e restaurar instantâneos

source: This release addresses the followings:
pt_br: Esta versão aborda os seguintes:

source: More consistent UI
pt_br: UI mais consistente

source: Dutch translations (thanks Philip Goto)
pt_br: Traduções holandesas (obrigado Philip Goto)

source: Feature: step forward one generation
pt_br: Recurso: Avanço de uma geração

source: Group design tools in revealer
pt_br: Ferramentas de design de grupo no revendedor

source: New icon (thanks to Tobias Bernard)
pt_br: Novo ícone (obrigado a Tobias Bernard)

source: Reduce close button size
pt_br: Reduza o tamanho do botão fechar

source: Fixes main menu button shape
pt_br: FIXE a forma do botão do menu principal

source: Fixes a few problems with the main menu entries
pt_br: Corrige alguns problemas com as entradas do menu principal

source: Layout changes
pt_br: Alterações no layout

source: Fixes templates not being loaded
pt_br: Modelos de correções não estão sendo carregados

source: Moves grid rendering to gtk4 render node api
pt_br: Move a renderização da grade para o GTK4 renderize API do nó

source: Allow for cells fade out when they die
pt_br: Permita que as células desapareçam quando elas morrem

source: Performance issues on edge cases
pt_br: Problemas de desempenho em casos de borda

source: gtk4/glib/libadwaita stack upgrade
pt_br: Atualização da pilha gtk4/glib/libadwaita

source: Translations:
pt_br: Traduções:

source: Add french translation (Rene Coty)
pt_br: Adicione a tradução em francês (Rene Coty)

source: This is a revision addressing a few problems
pt_br: Esta é uma revisão abordando alguns problemas

source: Fix interaction bugs
pt_br: Corrija erros de interação

source: Minor performance tweaks
pt_br: Ajustes de desempenho menores

source: Fades out cells when they die instead of deleting them in one go
pt_br: Desaparece as células quando elas morrem em vez de excluí -las de uma só vez

source: The number of generations per seconds that should be computed when a simulation is running
pt_br: O número de gerações por segundos que devem ser calculadas quando uma simulação estiver em execução

source: The width of the universe being generated, in cells number
pt_br: A largura do universo que está sendo gerada, no número das células

source: The height of the universe being generated, in cells number
pt_br: A altura do universo que está sendo gerada, no número das células

source: Wheter to draw cells outline in universe grid
pt_br: Se deve desenhar o contorno das células na grade do universo.

source: Wheter to allow universe rendering when the application window is resizing
pt_br: Se deve permitir a renderização do universo quando a janela do aplicativo estiver redimensionando

source: Wheter to show an interaction hint on design mode activated
pt_br: Se deve mostrar uma dica de interação no modo de design ativado

# shortcut window
source: General
pt_br: Em geral

# shortcut window
source: New Universe
pt_br: Novo universo

# shortcut window
source: Open Snapshot
pt_br: Abrir instantâneo

# shortcut window
source: Save Snapshot
pt_br: Salve o instantâneo

# shortcut window
source: Preferences
pt_br: Preferências

# shortcut window
source: Show Shortcuts
pt_br: Mostre atalhos

# shortcut window
source: Close
pt_br: Fechar

# shortcut window
source: Universe Control
pt_br: Controle do Universo

# shortcut window
source: Toggle Design Mode
pt_br: Modo de design de alternância

# shortcut window
source: Toggle Run Universe
pt_br: Alternar universo

# shortcut window
source: Seed Universe
pt_br: Universo semente

source: Left click to make a cell alive, right click to make it dead
pt_br: Clique esquerdo para tornar uma célula viva, clique com o botão direito para deixá -lo morto

source: Do not show again
pt_br: Não mostre de novo

source: _Save
pt_br: _Salvar

source: _Cancel
pt_br: _Cancelar

source: Save universe snapshot
pt_br: Salvar instantâneo do universo

source: Unable to write to file
pt_br: Incapaz de escrever para arquivo

source: Unable to serialize snapshot
pt_br: Incapaz de serializar o instantâneo

source: _Open
pt_br: _Abrir

source: Open universe snapshot
pt_br: Abrir instantâneo do universo.

source: Unreadable file
pt_br: Arquivo ilegível

source: File not existing or not accessible
pt_br: Arquivo não existente ou não acessível

source: Bad template data
pt_br: Dados de modelo ruim

source: Template not found
pt_br: Modelo não encontrado

# a11y
source: Toggle design mode
pt_br: Modo de design de alternância

source: Toggle design tools
pt_br: Alternante ferramentas de design

source: Cell brush
pt_br: Escova de células

# a11y
source: Cell brush
pt_br: Escova de células

source: Randomly seed this universe
pt_br: Semente aleatória este universo

# a11y
source: Randomly seed this universe
pt_br: Semente aleatória este universo

source: Toggle universe run
pt_br: Alternar execução do universo.

# a11y
source: Toggle universe run
pt_br: Alternar execução do universo.

source: Skip forward one generation
pt_br: Pule para frente uma geração

# a11y
source: Skip forward one generation
pt_br: Pule para frente uma geração

source: _New Universe
pt_br: _Novo universo

source: _Open Snapshot
pt_br: _Abrir instantâneo

source: _Save Snapshot
pt_br: _Salve o instantâneo

source: _Preferences
pt_br: _Preferências

source: _Keyboard Shortcuts
pt_br: _Atalhos de teclado

source: _About Game of Life
pt_br: _Sobre o Jogo da Vida

source: _Close
pt_br: _Fechar

source: New universe
pt_br: Novo universo

source: Empty universe
pt_br: Universo vazio

source: Random seed
pt_br: Semente aleatória

source: Template
pt_br: Modelo

source: Glider
pt_br: Planador

source: Quadpole
pt_br: Quadrupolo

source: Spaceship
pt_br: Espaço

source: Circle of fire
pt_br: Círculo de Fogo

source: Cancel
pt_br: Cancelar

source: Create
pt_br: Criar

source: General
pt_br: Em geral

source: Various application feedbacks settings
pt_br: Várias configurações de feedbacks de aplicativos

source: Design hint
pt_br: Dica de design

source: Show a toast describing interaction modes during design mode
pt_br: Mostre uma torrada descrevendo os modos de interação durante o modo de design

source: Universe
pt_br: Universo

source: Appearance
pt_br: Aparência

source: Light colors
pt_br: Cores claras

source: These colors are applied if you use a light scheme color on your desktop
pt_br: Essas cores são aplicadas se você usar uma cor de esquema de luz na sua área de trabalho

source: Dark colors
pt_br: Cores escuras

source: These colors are applied if you use a dark scheme color on your desktop
pt_br: Essas cores são aplicadas se você usar uma cor do tema escuro em sua área de trabalho

source: Draw cells outline
pt_br: Desenhe o esboço das células

source: Fade out dead cells
pt_br: Desbotado células mortas

source: Render on resize
pt_br: Renderizar em redimensionar

source: Allows rendering the grid during a resize event of the application window. May affect performance.
pt_br: Permite renderizar a grade durante um evento de redimensionamento da janela do aplicativo. Pode afetar o desempenho.

source: Evolution
pt_br: Evolução

source: Evolutions speed
pt_br: Velocidade da evolução

source: The number of generations to be computed per second during an evolution
pt_br: O número de gerações a ser calculado por segundo durante uma evolução
